app/controllers/tasks_controller.rb

    def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", ""], ["completed", nil], ["created_at", "2022-12-14 11:12:33.950859"], ["updated_at", "2022-12-14 11:12:33.950859"]]

  def update
    @task = Task.find(params[:id])
    respond_to do |format|
      if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Edited"], ["updated_at", "2022-12-14 11:28:33.241238"], ["id", 15]]

  def toggle
    @task = Task.find(params[:id])
    @task.update(completed: params[:completed])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2022-12-14 12:05:12.717547"], ["id", 14]]